InformationRegisters/СеансовыеДанныеGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СеансовыеДанныеGoogle</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>access_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>token_type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>refresh_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>disabled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДGoogleПриложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиДоступаGoogle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИнкрементнаяСинхронизация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИнкрементнаяСинхронизация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СинхроТокен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НепросмотренныеДокументыССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НепросмотренныеДокументыССайта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистОжидания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПриложенияGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПриложенияGoogle</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбластиДоступаGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОбластиДоступаGoogle</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Профиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Календарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контакты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛистОжидания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЛистОжидания</Name>
			<BasedOn>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВыполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЛистаОжидания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗаписиНаПрием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoogleIDСобытия</Name>
					<Comment>Используется 33 символа, непонятно, как будет потом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoogleКалендарьИмпорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРекламы</Name>
					<Comment>UTM_MEDIUM</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРекламы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Comment>UTM_SOURCE</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКомпания</Name>
					<Comment>UTM_CAMPAIGN</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеСловоРекламнойКомпании</Name>
					<Comment>UTM_TERM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОбъявления</Name>
					<Comment>UTM_CONTENT</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЖелаемоеВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененияПериода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КалендариСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КалендариСотрудников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>primary</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>selected</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>summary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>timeZone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьСGoogle</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбменСGoogle/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура выполняет инициализацию сеансовых данных OAuth2 для работы с Google
// В случае если переданные сеансовые данные не заполнены (структура не содержит
// токен доступа access_token), выполняется их чтение из регистра сведений 
// СеансовыеДанныеGoogle, проверка действительности на сервере Google, и, 
// в случае необходимости обновление с помощью токена обновления refresh_token.
// В случае если сеансовые данные заполнены, выполняется их проверка и запись 
// в регистр сведений.
//
// Параметры:
//  Данные			- Структура - сеансовые данные,
//  ключи соответствуют ресурсам регистра СеансовыеДанныеGoogle
//  Пользователь	- СправочникСсылка.Пользователи
//  ОбластьДоступа	- ПеречислениеСсылка.ОбластиДоступаGoogle
//  УчетнаяЗаписьЭлектроннойПочты - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - указывается для области доступа "Почта"
//
Процедура ИнициализироватьСеансовыеДанные(Данные, Пользователь, ОбластьДоступа, УчетнаяЗаписьЭлектроннойПочты = Неопределено) Экспорт
	
	Если ОбластьДоступа = Перечисления.ОбластиДоступаGoogle.Почта
		И Не ЗначениеЗаполнено(УчетнаяЗаписьЭлектроннойПочты) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана учетная запись электронной почты.'");
	КонецЕсли;
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(Данные) Тогда
		РегистрыСведений.СеансовыеДанныеGoogle.ПрочитатьИОбновитьСеансовыеДанные(Данные, Пользователь, ОбластьДоступа, УчетнаяЗаписьЭлектроннойПочты);
	Иначе
		РегистрыСведений.СеансовыеДанныеGoogle.ПроверитьИЗаписатьСеансовыеДанные(Данные, Пользователь, ОбластьДоступа, УчетнаяЗаписьЭлектроннойПочты);
	КонецЕсли;
	
	Если Не ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(Данные) Тогда
		СоздатьGoogleКалендари(Данные,Пользователь);
	КонецЕсли; 
	
КонецПроцедуры

// Функция возвращает данные авторизованного пользователя
//
// Параметры:
//  СеансовыеДанные	 - Структура -  - сеансовые данные, 
//  ключи соответствуют ресурсам регистра СеансовыеДанныеGoogle
// 
// Возвращаемое значение:
//  Соответствие - данные авторизованного пользователя
//
Функция ДанныеАвторизованногоПользователя(Знач СеансовыеДанные) Экспорт
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
	"https://www.googleapis.com/oauth2/v2/userinfo");
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВызовМетода(АдресAPI, СеансовыеДанные));
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	Возврат РезультатЧтенияJSON;
	
КонецФункции

Функция МетаданныеСообщения(Знач СеансовыеДанные, ИдентификаторСообщения) Экспорт
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
	СтрШаблон("https://www.googleapis.com/gmail/v1/users/me/messages/%1?format=metadata%2",
	ИдентификаторСообщения,
	КвотаПользователя("&quotaUser")));
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВызовМетода(АдресAPI, СеансовыеДанные));
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	Возврат РезультатЧтенияJSON;
	
КонецФункции

// Синхронизация с Google Calendar в фоновом задании
//
// Параметры:
//  СеансовыеДанные	 - Структура - поля соответствуют ресурсам регистра сведений СеансовыеДанныеGoogle
//  АдресХранилища	 - Строка - используется для совместимости с подсистемой ДлительныеОперации
//  Пользователь	 - СправочникСсылка.Пользователь - Пользователь для которого выполняется синхронизация,
//                     если Пользователь не указан, то используется Пользователи.ТекущийПользователь();
//
Процедура СинхронизироватьGoogleCalendar(Знач СеансовыеДанные, Знач АдресХранилища = Неопределено, Знач Пользователь = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Если Не ЗначениеЗаполнено(СеансовыеДанные.Пользователь) Тогда 
			Возврат;
		Иначе 
			Пользователь = СеансовыеДанные.Пользователь;
		КонецЕсли;
	КонецЕсли;
	
	СоздатьОтсутствующиеКалендариВGoogle(СеансовыеДанные, Пользователь);
	ВыгрузитьДанныеGoogleCalendar(СеансовыеДанные, Пользователь);
	ЗагрузитьДанныеGoogleCalendar(СеансовыеДанные, Пользователь);	
	
КонецПроцедуры

// Формирует ключ из идентификатора посредством расчета хеш-суммы по алгоритму SHA-256
//
// Параметры:
//  Идентификатор	 - Строка - идентификатор, для которого нужно получить ключ
//  КонтекстПроверки - Строка - параметр передаётся в процедуру ОбщегоНазначенияКлиентСервер.Проверить()
//  и позволяет определить, откуда произошёл вызов в случае ошибки. 
// 
// Возвращаемое значение:
//  Строка - строка длинной 64 символа, значение вычисленной хеш-суммы
//
Функция КлючИзИдентификатора(Идентификатор, КонтекстПроверки) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(
	ЗначениеЗаполнено(Идентификатор),
	НСтр("ru = 'Не указан Идентификатор для преобразования его в Ключ'"),
	КонтекстПроверки);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
	ТипЗнч(Идентификатор) = Тип("Строка"),
	НСтр("ru = 'Идентификатор должен быть строкового типа'"),
	КонтекстПроверки);
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(Идентификатор);
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
	
КонецФункции

Процедура ИнициализироватьУзелПланаОбменаДляКалендаряGoogle() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтотУзел = ПланыОбмена.ОбменСGoogleCalendar.ЭтотУзел();
	Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотУзел, "Код")) Тогда
		Возврат;
	КонецЕсли;
	
	УзелОбъект = ЭтотУзел.ПолучитьОбъект();
	УзелОбъект.ОбменДанными.Загрузка = Истина;
	УзелОбъект.УстановитьНовыйКод();
	УзелОбъект.Наименование = НСтр("ru = 'Этот узел'");
	УзелОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик регламентного задания СинхронизацияGoogleCalendar
//
Процедура ЗаданиеСинхронизироватьКалендарь() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Константы.ИспользоватьОбменСКалендаремGoogle.Получить() Тогда
    	Возврат;
	КонецЕсли;
	
	ЗапросПользователиСеансовыхДанных = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СеансовыеДанныеGoogle.Пользователь
	|ИЗ
	|	РегистрСведений.СеансовыеДанныеGoogle КАК СеансовыеДанныеGoogle
	|ГДЕ
	|	НЕ СеансовыеДанныеGoogle.disabled");
	
	РезультатЗапроса = ЗапросПользователиСеансовыхДанных.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СеансовыеДанные = РегистрыСведений.СеансовыеДанныеGoogle.СеансовыеДанные(
		Выборка.Пользователь,
		Перечисления.ОбластиДоступаGoogle.Календарь);
		
		Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не РегистрыСведений.СеансовыеДанныеGoogle.ТокенДоступаДействителен(СеансовыеДанные.access_token, СеансовыеДанные.ИДGoogleПриложения) Тогда
			РегистрыСведений.СеансовыеДанныеGoogle.ОбновитьСеансовыеДанные(
			СеансовыеДанные,
			Выборка.Пользователь,
			Перечисления.ОбластиДоступаGoogle.Календарь);
			СеансовыеДанные = РегистрыСведений.СеансовыеДанныеGoogle.СеансовыеДанные(
			Выборка.Пользователь,
			Перечисления.ОбластиДоступаGoogle.Календарь);
		КонецЕсли;
		
		СинхронизироватьGoogleCalendar(СеансовыеДанные,, Выборка.Пользователь);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначениеКонстантыИспользоватьОбменСКалендаремGoogle() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьОбменСКалендаремGoogle.Получить();
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьGoogleКалендари(СеансовыеДанные, Пользователь)
	
	ОписанияВсехКалендарей = ОписанияВсехКалендарей(СеансовыеДанные);
	
	Если ЗначениеЗаполнено(ОписанияВсехКалендарей["error"]) Тогда
		ОбработатьОшибкиАвторизации(СеансовыеДанные, ОписанияВсехКалендарей["error"]);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекОписаниеКалендаря Из ОписанияВсехКалендарей["items"] Цикл
		
		Если ТекОписаниеКалендаря["accessRole"] <> "owner" Тогда
			Продолжить;
		КонецЕсли;
		
		КалендарьСотрудника = СсылкаНаКалендарьСотрудника(ТекОписаниеКалендаря, Пользователь);

	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьДанныеGoogleCalendar(СеансовыеДанные, Пользователь)
	
	ОписанияВсехКалендарей = ОписанияВсехКалендарей(СеансовыеДанные);
	
	Если ЗначениеЗаполнено(ОписанияВсехКалендарей["error"]) Тогда
		ОбработатьОшибкиАвторизации(СеансовыеДанные, ОписанияВсехКалендарей["error"]);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекОписаниеКалендаря Из ОписанияВсехКалендарей["items"] Цикл
		
		Если ТекОписаниеКалендаря["accessRole"] <> "owner" Тогда
			Продолжить;
		КонецЕсли;
		
		СтраничныйТокен = "";
		
		// Цикл выполняется пока страничный токен не станет равным Неопределено
		Пока ЗначениеЗаполнено(СтраничныйТокен) Или СтраничныйТокен= "" Цикл
			
			КалендарьСотрудника = СсылкаНаКалендарьСотрудника(ТекОписаниеКалендаря, Пользователь);
			
			Если Не ЗначениеЗаполнено(КалендарьСотрудника) Тогда
				Прервать;
			КонецЕсли;
			
			СинхроТокен = РегистрыСведений.ИнкрементнаяСинхронизация.СинхроТокен(КалендарьСотрудника);
			
			СобытияКалендаря = СобытияКалендаря(
			ТекОписаниеКалендаря["id"],
			СинхроТокен,
			СтраничныйТокен,
			СеансовыеДанные);
			
			Если СобытияКалендаря["error"] <> Неопределено 
				И СобытияКалендаря["error"]["code"] = 410 Тогда
				// Выполняется полная синхронизация, без указания синхротокена
				СобытияКалендаря = СобытияКалендаря(
				ТекОписаниеКалендаря["id"],,
				СтраничныйТокен,
				СеансовыеДанные);
			КонецЕсли;
			
			Если СобытияКалендаря["error"] <> Неопределено Тогда
				ВызватьИсключение 
				СтрШаблон(
				НСтр("ru = 'Произошла ошибка синхронизации с Google Calendar: %1'"),
				СобытияКалендаря["error"]["message"]);
			КонецЕсли;
			
			Для Каждого ТекОписаниеСобытия Из СобытияКалендаря["items"] Цикл
				ОбновитьЗаписьКалендаря(КалендарьСотрудника, ТекОписаниеСобытия, Пользователь);
			КонецЦикла;
			
			СтраничныйТокен = СобытияКалендаря["nextPageToken"];
			
			Если ЗначениеЗаполнено(СобытияКалендаря["nextSyncToken"]) Тогда
				РегистрыСведений.ИнкрементнаяСинхронизация.ЗаписатьСинхроТокен(КалендарьСотрудника, СобытияКалендаря["nextSyncToken"]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура СоздатьОтсутствующиеКалендариВGoogle(СеансовыеДанные, Пользователь)
	
	ЗапросКалендариСотрудника = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КалендариСотрудников.Ссылка КАК КалендарьСотрудника,
	|	КалендариСотрудников.id КАК ИдентификаторКалендаря,
	|	КалендариСотрудников.Наименование КАК НаименованиеКалендаря
	|ИЗ
	|	Справочник.КалендариСотрудников КАК КалендариСотрудников
	|ГДЕ
	|	КалендариСотрудников.СинхронизироватьСGoogle
	|	И НЕ КалендариСотрудников.ПометкаУдаления
	|	И КалендариСотрудников.ВладелецКалендаря = &Пользователь");
	ЗапросКалендариСотрудника.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = ЗапросКалендариСотрудника.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторКалендаря) Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьКалендарьВGoogle(Выборка.КалендарьСотрудника, Выборка.НаименованиеКалендаря, СеансовыеДанные);
		//УстановитьЦветКалендаряВGoogle(Выборка.КалендарьСотрудника, Пользователь, СеансовыеДанные);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьКалендарьВGoogle(КалендарьСотрудника, НаименованиеКалендаря, СеансовыеДанные)
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
	"https://www.googleapis.com/calendar/v3/calendars");
	
	ДанныеКалендаря = Новый Соответствие;
	ДанныеКалендаря["summary"] = НаименованиеКалендаря;
	
	Заголовки = Новый Соответствие;
	Заголовки["Content-Type"] = "application/json";
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеКалендаря);
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВызовМетода(АдресAPI, СеансовыеДанные, "POST", Заголовки, ТелоЗапроса));
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	КалендарьОбъект = КалендарьСотрудника.ПолучитьОбъект();
	КалендарьОбъект.id = РезультатЧтенияJSON["id"];
	
	КалендарьОбъект.ОбменДанными.Загрузка = Истина;
	КалендарьОбъект.Записать();
	
КонецПроцедуры

Процедура УстановитьЦветКалендаряВGoogle(КалендарьСотрудника, Пользователь, СеансовыеДанные)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
	
	НастройкиДоступныхКалендарей = НастройкиДоступныхКалендарей(ПользовательИБ);
	НайденнаяНастройка = НастройкиДоступныхКалендарей.Найти(КалендарьСотрудника);
	Если НайденнаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
	СтрШаблон(
	"https://www.googleapis.com/calendar/v3/users/me/calendarList/%1",
	КалендарьСотрудника.id));
	
	ПараметрыКалендаря = Новый Соответствие;
	ПараметрыКалендаря["colorId"] = НайденнаяНастройка.ВариантЦвета;
	
	Заголовки = Новый Соответствие;
	Заголовки["Content-Type"] = "application/json";
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ПараметрыКалендаря);
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВызовМетода(АдресAPI, СеансовыеДанные, "PATCH", Заголовки, ТелоЗапроса));
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	
КонецПроцедуры

Процедура ВыгрузитьДанныеGoogleCalendar(СеансовыеДанные, Пользователь)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаписиКалендаряСотрудникаИзменения.Узел КАК Узел,
	|	ЗаписиКалендаряСотрудникаИзменения.Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряСотрудника.Изменения КАК ЗаписиКалендаряСотрудникаИзменения
	|ГДЕ
	|	ЗаписиКалендаряСотрудникаИзменения.Узел.КалендарьСотрудника.ВладелецКалендаря = &Пользователь
	|ИТОГИ ПО
	|	Узел");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Массив;
	
	// Выгружаем данные порциями по 50 записей, 
	// это максимально допустимый размер для пакетного запроса
	ВыборкаКалендари = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКалендари.Следующий() Цикл
		
		ДанныеДляВыгрузки.Очистить();
		
		ВыборкаСсылки = ВыборкаКалендари.Выбрать();
		Пока ВыборкаСсылки.Следующий() Цикл
			ДанныеДляВыгрузки.Добавить(ВыборкаСсылки.Ссылка);
			Если ДанныеДляВыгрузки.Количество() < 50 Тогда
				Продолжить;
			КонецЕсли;
			ВыгрузитьДанныеВУзел(ВыборкаКалендари.Узел, ДанныеДляВыгрузки, СеансовыеДанные);
			ДанныеДляВыгрузки.Очистить();
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеДляВыгрузки) Тогда
			ВыгрузитьДанныеВУзел(ВыборкаКалендари.Узел, ДанныеДляВыгрузки, СеансовыеДанные);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьДанныеВУзел(Узел, ДанныеДляВыгрузки, СеансовыеДанные)
	
	ГраницаСекций = НоваяГраницаСекций();
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI("https://www.googleapis.com/batch/calendar/v3");
	
	//ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(АдресAPI.Схема);
	
	HTTPСоединение = Новый HTTPСоединение(
	АдресAPI.Хост,
	АдресAPI.Порт,,,
	,
	20,
	ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
	
	ПакетныйЗапросHTTP = Новый HTTPЗапрос;
	ПакетныйЗапросHTTP.АдресРесурса = АдресAPI.ПутьНаСервере;
	ПакетныйЗапросHTTP.Заголовки["Authorization"] = СтрШаблон("%1 %2", СеансовыеДанные["token_type"], СеансовыеДанные["access_token"]);
	ПакетныйЗапросHTTP.Заголовки["Content-Type"] = СтрШаблон("multipart/mixed; boundary=%1", ГраницаСекций);
	
	// ЗаписьСообщения используется только для управления нумерацией сообщений
	// Реальная запись будет производиться в отправляемый по HTTPS пакет
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Узел);
	
	ВыборкаДанных = ПланыОбмена.ВыбратьИзменения(Узел, ЗаписьСообщения.НомерСообщения, ДанныеДляВыгрузки);
	
	ТелоПакетногоЗапросаИзменениеДанныхКалендаря = ТелоПакетногоЗапросаИзменениеДанныхКалендаря(ВыборкаДанных, ГраницаСекций);
	
	Если Не ЗначениеЗаполнено(ТелоПакетногоЗапросаИзменениеДанныхКалендаря) Тогда
		Возврат;
	КонецЕсли;
	
	ПакетныйЗапросHTTP.УстановитьТелоИзСтроки(
	ТелоПакетногоЗапросаИзменениеДанныхКалендаря,,
	ИспользованиеByteOrderMark.НеИспользовать);
	ПакетныйОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(ПакетныйЗапросHTTP);
	
	Если ПакетныйОтветHTTP.КодСостояния = 200 Тогда
		НомерСообщения = ЗаписьСообщения.НомерСообщения;
		ЗаписьСообщения.ЗакончитьЗапись();
	Иначе
		ЗаписьСообщения.ПрерватьЗапись();
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерСообщения);
	
КонецПроцедуры

Функция ТелоПакетногоЗапросаИзменениеДанныхКалендаря(ВыборкаДанных, ГраницаСекций)
	
	Результат = "";
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		Данные = ВыборкаДанных.Получить();
		
		Если Данные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Данные) = Тип("УдалениеОбъекта") Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДляИзменения = Новый Соответствие;
		
		Если Не ЗначениеЗаполнено(Данные.Идентификатор) Тогда
			ДанныеДляИзменения["id"] = СтрЗаменить(Данные.Ссылка.УникальныйИдентификатор(), "-", "");
		КонецЕсли;
		
		ДанныеДляИзменения["location"] = Данные.МестоПроведения;
		ДанныеДляИзменения["description"] = Данные.Описание;
		ДанныеДляИзменения["summary"] = Данные.Наименование;
		
		ДанныеДляИзменения["start"] = ОписаниеДатыСобытия(Данные.Начало);
		ДанныеДляИзменения["end"] = ОписаниеДатыСобытия(Данные.Окончание);
		
		Если Данные.ПометкаУдаления Или Данные.УдаленаОтменена Тогда
			ДанныеДляИзменения["status"] = "cancelled"
		Иначе
			ДанныеДляИзменения["status"] = "tentative";
		КонецЕсли;
		
		Если ИмяМетодаHTTP(Данные) = "DELETE" Тогда
			
			Результат = СтрШаблон(
			"%1--%2
			|Content-Type: application/http
			|Content-ID: %3
			|
			|%4 /calendar/v3/calendars/%5/events/%6",
			ОтступДляСекции(Результат),					// 1
			ГраницаСекций,								// 2
			Данные.Ссылка.УникальныйИдентификатор(),	// 3
			ИмяМетодаHTTP(Данные),						// 4
			Данные.Календарь.id,						// 5
			Данные.Идентификатор);						// 6
			
		Иначе // POST, PATCH
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			НастройкиСериализации = Новый НастройкиСериализацииJSON;
			НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
			ЗаписатьJSON(ЗаписьJSON, ДанныеДляИзменения, НастройкиСериализации);
			СтрокаJSON = СтрЗаменить(ЗаписьJSON.Закрыть(), """%null%""", "null"); // Удаление полей
			
			Результат = СтрШаблон(
			"%1--%2
			|Content-Type: application/http
			|Content-ID: %3
			|
			|%4 /calendar/v3/calendars/%5/events/%6%7
			|Content-Type: application/json
			|%8
			|%9",
			ОтступДляСекции(Результат),					// 1
			ГраницаСекций,								// 2
			Данные.Ссылка.УникальныйИдентификатор(),	// 3
			ИмяМетодаHTTP(Данные),						// 4
			Данные.Календарь.id,						// 5
			Данные.Идентификатор,						// 6
			ПередаваемыеПоля(Данные.Идентификатор),		// 7
			ЗаголовокETag(Данные.ETag),					// 8
			СтрокаJSON);								// 9
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрШаблон(
		"%1
		|
		|--%2--",
		Результат,
		ГраницаСекций);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеДатыСобытия(Знач ДатаВремя)
	
	Результат = Новый Соответствие;
	
	ДатаВремяПриведенноеКСерверу = МестноеВремя(УниверсальноеВремя(ДатаВремя, ПолучитьЧасовойПоясИнформационнойБазы()));
	
	Если НачалоДня(ДатаВремяПриведенноеКСерверу) = ДатаВремяПриведенноеКСерверу Тогда
		Результат["date"] = Формат(ДатаВремяПриведенноеКСерверу, "ДФ=yyyy-MM-dd");
		Результат["dateTime"] = "%null%";
	Иначе
		Результат["date"] = "%null%";
		Результат["dateTime"] = ДатаВремяПриведенноеКСерверу;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтступДляСекции(ТелоСообщения)
	
	Если ЗначениеЗаполнено(ТелоСообщения) Тогда
		Возврат ТелоСообщения + Символы.ПС + Символы.ПС;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПередаваемыеПоля(Идентификатор)
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат "?fields=etag,start,end,status,summary,description,attendees";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЗаголовокETag(ETag)
	
	Если ЗначениеЗаполнено(ETag) Тогда
		Возврат СтрШаблон(
		"If-Match: %1%2",
		ETag,
		Символы.ПС);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ИмяМетодаHTTP(Данные)
	
	Если Данные.ПометкаУдаления Тогда
		Возврат "DELETE";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Идентификатор) Тогда
		Возврат "PATCH";
	КонецЕсли;
	
	Возврат "POST";
	
КонецФункции

Процедура ОбработатьОшибкиАвторизации(СеансовыеДанные, ОписаниеОшибки)
	
	Для Каждого ТекОписаниеОшибки Из ОписаниеОшибки["errors"] Цикл
		Если ТекОписаниеОшибки["reason"] = "authError" Тогда
			СеансовыеДанные=Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПолеДатаВремя(Приемник, ИмяПоляПриемник, Источник, ИмяПоляИсточник)
	
	Если Не ЗначениеЗаполнено(Источник[ИмяПоляИсточник]) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник[ИмяПоляИсточник]["dateTime"]) Тогда
		ЗначениеПоляДатаВремя = Источник[ИмяПоляИсточник]["dateTime"];
	Иначе
		ЗначениеПоляДатаВремя = Источник[ИмяПоляИсточник]["date"];
	КонецЕсли;
	
	ЗначениеПриведенноеКЧасовомуПоясуИБ = МестноеВремя(УниверсальноеВремя(ЗначениеПоляДатаВремя), ПолучитьЧасовойПоясИнформационнойБазы());
	
	Приемник.Вставить(ИмяПоляПриемник, ЗначениеПриведенноеКЧасовомуПоясуИБ);
	
КонецПроцедуры

Функция ОписанияВсехКалендарей(СеансовыеДанные)
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
	"https://www.googleapis.com/calendar/v3/users/me/calendarList");
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВызовМетода(АдресAPI, СеансовыеДанные));
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	Возврат РезультатЧтенияJSON;
	
КонецФункции

Функция СобытияКалендаря(ИдентификаторКалендаря, СинхроТокен, СтраничныйТокен, СеансовыеДанные)
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
	СтрШаблон(
	"https://www.googleapis.com/calendar/v3/calendars/%1/events?singleEvents=True&maxResults=256&timeZone=%2%3%4%5",
	ИдентификаторКалендаря,
	ЧасовойПояс(),
	ПараметрПериод(СинхроТокен),
	ПараметрСинхроТокен(СинхроТокен),
	ПараметрСтраничныйТокен(СтраничныйТокен)));
	
	СтрокаJSON = ВызовМетода(АдресAPI, СеансовыеДанные);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON,
	Истина,,,
	"ВосстановитьДатуJSON",
	ОбменСGoogle,,
	СтрРазделить("created,date,dateTime,updated", ","));
	
	Возврат РезультатЧтенияJSON;
	
КонецФункции

Функция ВосстановитьДатуJSON(Свойство, Значение, Параметры) Экспорт
	
	Попытка
		
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Синхронизация календаря Google.'"),
		УровеньЖурналаРегистрации.Предупреждение,,,
		СтрШаблон(
		НСтр("ru = 'Не удалось прочитать дату JSON для свойства ""%1"": ""%2"".'"), 
		Свойство,
		Значение));
		
	КонецПопытки;
	
	Возврат '0001-01-01';
	
КонецФункции

Функция ПараметрПериод(СинхроТокен)
	
	Если ЗначениеЗаполнено(СинхроТокен) Тогда
		Возврат "";
	КонецЕсли;
	
	Начало = ЗаписатьДатуJSON(
	НачалоДня(ТекущаяДатаСеанса()),
	ФорматДатыJSON.ISO,
	ВариантЗаписиДатыJSON.УниверсальнаяДата);
	
	Окончание = ЗаписатьДатуJSON(
	ДобавитьМесяц(КонецДня(ТекущаяДатаСеанса()), 24),
	ФорматДатыJSON.ISO,
	ВариантЗаписиДатыJSON.УниверсальнаяДата);
	
	Возврат СтрШаблон("&timeMin=%1&timeMax=%2", Начало, Окончание);
	
КонецФункции

Функция ПараметрСинхроТокен(СинхроТокен)
	
	Если ЗначениеЗаполнено(СинхроТокен) Тогда
		Возврат СтрШаблон("&syncToken=%1", СинхроТокен);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПараметрСтраничныйТокен(СтраничныйТокен)
	
	Если ЗначениеЗаполнено(СтраничныйТокен) Тогда
		Возврат СтрШаблон("&pageToken=%1", СтраничныйТокен);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВызовМетода(АдресAPI, СеансовыеДанные = Неопределено, HTTPМетод = Неопределено, ДополнительныеЗаголовки = Неопределено, ТелоЗапроса = Неопределено)
	
//	ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(АдресAPI.Схема);
	
	HTTPСоединение = Новый HTTPСоединение(
	АдресAPI.Хост,
	АдресAPI.Порт,,,
	,
	20,
	Новый ЗащищенноеСоединениеOpenSSL);
	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.АдресРесурса = АдресAPI.ПутьНаСервере;
	ЗапросHTTP.Заголовки["Content-Type"] = "application/x-www-form-urlencoded";
	Если СеансовыеДанные <> Неопределено Тогда
		ЗапросHTTP.Заголовки["Authorization"] = СтрШаблон(
		"%1 %2",
		СеансовыеДанные["token_type"],
		СеансовыеДанные["access_token"]);
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеЗаголовки)=Тип("Соответствие") Тогда
		Для Каждого ДопЗаголовок Из ДополнительныеЗаголовки Цикл
			ЗапросHTTP.Заголовки[ДопЗаголовок.Ключ] = ДопЗаголовок.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если ТелоЗапроса <> Неопределено Тогда
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса,, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Если HTTPМетод = Неопределено Тогда
		ОтветHTTP = HTTPСоединение.Получить(ЗапросHTTP);
	Иначе
		ОтветHTTP = HTTPСоединение.ВызватьHTTPМетод(HTTPМетод, ЗапросHTTP);
	КонецЕсли;
	
	Возврат ОтветHTTP.ПолучитьТелоКакСтроку();
	
КонецФункции

Функция НоваяГраницаСекций()
	
	Возврат СтрЗаменить(Новый УникальныйИдентификатор(), "-", "");

КонецФункции

// Записывает настройки календаря в хранилище общих настроек пользователя.
//
// Параметры:
//  КалендарьСотрудника	 - СправочникСсылка.КалендариСотрудников - календарь, для которого сохраняются настройки.
//  ДанныеЗаполнения	 - Структура - структура, содержащая ключи:
//   * Пользователь - СправочниикСсылка.Пользователи - пользователь, для которого сохраняются настройки,
//   * colorId - Число - индекс цвета в Google,
//   * selected - Булево - признак того, что календарь отмечен как выбранный,
//   * primary - Булево - признак того, что календарь отмечен как основной.
Процедура ЗаписатьНастройкиКалендаря(КалендарьСотрудника, ДанныеЗаполнения) Экспорт
	
	// Свойство "Пользователь" в ДанныхЗаполнения устанавливается только для новых календарей
	// Для ранее записанных календарей настройки при обмене не обновляем
	Если Не ДанныеЗаполнения.Свойство("Пользователь") Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Пользователь, "ИдентификаторПользователяИБ"));
	
	НастройкиДоступныхКалендарей = НастройкиДоступныхКалендарей(ПользовательИБ);
	
	НоваяНастройка = НастройкиДоступныхКалендарей.Добавить();
	НоваяНастройка.Календарь = КалендарьСотрудника;
	Если ДанныеЗаполнения.Свойство("colorId") Тогда
		НоваяНастройка.ВариантЦвета = ДанныеЗаполнения.colorId;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("selected") Тогда
		НоваяНастройка.Выбран = ДанныеЗаполнения.selected;
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
	"НастройкиКалендаряСотрудника",
	"ДоступныеКалендари",
	НастройкиДоступныхКалендарей,,
	ПользовательИБ.Имя);
	
	УстановитьКалендарьПоУмолчанию(КалендарьСотрудника, ДанныеЗаполнения);
	
КонецПроцедуры

Функция НастройкиДоступныхКалендарей(ПользовательИБ)
	
	ТаблицаНастроекПоУмолчанию = Новый ТаблицаЗначений;
	ТаблицаНастроекПоУмолчанию.Колонки.Добавить("Календарь", Новый ОписаниеТипов("СправочникСсылка.КалендариСотрудников"));
	ТаблицаНастроекПоУмолчанию.Колонки.Добавить("ВариантЦвета", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2)));
	ТаблицаНастроекПоУмолчанию.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиКалендаряСотрудника",
	"ДоступныеКалендари",
	ТаблицаНастроекПоУмолчанию,,
	ПользовательИБ.Имя);
	
КонецФункции

Процедура ОбновитьЗаписьКалендаря(КалендарьСотрудника, ЗаписьКалендаря, Пользователь)
	
	ЗаписьОбъект = Справочники.ЗаписиКалендаряСотрудника.ОбъектПоИдентификатору(
	ЗаписьКалендаря["id"],
	КалендарьСотрудника);
	
	ЗаписьОбъект.ПометкаУдаления = ЗаписьКалендаря["status"] = "cancelled";
	
	Если ЗаписьОбъект.ПометкаУдаления И Не ЗначениеЗаполнено(ЗаписьОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	
	ЗаполнитьПолеДатаВремя(ДанныеЗаполнения, "Начало", ЗаписьКалендаря, "start");
	ЗаполнитьПолеДатаВремя(ДанныеЗаполнения, "Окончание", ЗаписьКалендаря, "end");
	
	ДанныеЗаполнения.Вставить("Идентификатор", ЗаписьКалендаря["id"]);
	ДанныеЗаполнения.Вставить("ETag", ЗаписьКалендаря["etag"]);
	ДанныеЗаполнения.Вставить("Наименование", ЗаписьКалендаря["summary"]);
	ДанныеЗаполнения.Вставить("Описание", ЗаписьКалендаря["description"]);
	ДанныеЗаполнения.Вставить("МестоПроведения", ЗаписьКалендаря["location"]);	
	ДанныеЗаполнения.Вставить("Календарь", КалендарьСотрудника);
	
	ЗаписьОбъект.Заполнить(ДанныеЗаполнения);
	
	Если ЗаписьОбъект.ПометкаУдаления Тогда
		ОчиститьИсточник(ЗаписьОбъект);
	Иначе
		ПривязатьИсточникПоКлючу(ЗаписьОбъект, Пользователь);
	КонецЕсли;
		
	ЗаписьОбъект.ОбменДанными.Загрузка = Истина;
	ЗаписьОбъект.Записать();
	
	Если Константы.ИмпортИзGoogleЛистовОжидания.Получить() Тогда
		Если Не ЗначениеЗаполнено(ЗаписьОбъект.Источник) Тогда
			СоздатьЛистОжиданияНаОсновеЗаписиКалендаря(ЗаписьОбъект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьИсточник(ЗаписьОбъект)
	
	Если Не ЗначениеЗаполнено(ЗаписьОбъект.Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросНаличияДругихСсылокНаИсточник = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаписиКалендаряСотрудника.Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряСотрудника КАК ЗаписиКалендаряСотрудника
	|ГДЕ
	|	ЗаписиКалендаряСотрудника.Источник = &Источник
	|	И ЗаписиКалендаряСотрудника.ПометкаУдаления = ЛОЖЬ
	|	И ЗаписиКалендаряСотрудника.Ссылка <> &Ссылка");
	ЗапросНаличияДругихСсылокНаИсточник.УстановитьПараметр("Источник", ЗаписьОбъект.Источник);
	ЗапросНаличияДругихСсылокНаИсточник.УстановитьПараметр("Ссылка", ЗаписьОбъект.Ссылка);
	
	РезультатЗапроса = ЗапросНаличияДругихСсылокНаИсточник.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьОбъект.Источник = Неопределено;
	
КонецПроцедуры

// Процедура нужна для того, чтобы привязать источник для записи, для которой в Google был изменён календарь.
// В этом случае в Google создаётся новая запись, с таким же идентификатором.
//
Процедура ПривязатьИсточникПоКлючу(ЗаписьОбъект, Пользователь)
	
	Если ЗначениеЗаполнено(ЗаписьОбъект.Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаписиКалендаряСотрудника.Источник,
	|	ЗаписиКалендаряСотрудника.НомерСтрокиИсточника
	|ИЗ
	|	Справочник.ЗаписиКалендаряСотрудника КАК ЗаписиКалендаряСотрудника
	|ГДЕ
	|	ЗаписиКалендаряСотрудника.Ключ = &Ключ
	|	И ЗаписиКалендаряСотрудника.Календарь.ВладелецКалендаря = &Пользователь
	|	И ЗаписиКалендаряСотрудника.Источник <> ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)");
	Запрос.УстановитьПараметр("Ключ", КлючИзИдентификатора(ЗаписьОбъект.Идентификатор, ТипЗнч(ЗаписьОбъект)));
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Для Каждого РезультатЗапроса Из Запрос.ВыполнитьПакет() Цикл
		Если РезультатЗапроса.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЗаписьОбъект, Выборка);
		Прервать;
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает ссылку на календарь сотрудника.
//
// Параметры:
//  ОписаниеКалендаря	 - Соответствие - данные, полученные в результате выполнения запроса
//                         GET https://www.googleapis.com/calendar/v3/users/me/calendarList
//  Пользователь		 - СправочникСсылка.Пользователь - пользователь календаря.
// 
// Возвращаемое значение:
//  СправочникСсылка.КалендарьСотрудника - ссылка на календарь сотрудника или
//                                         ПустаяСсылка, для случая, когда
//                                         СинхронизироватьСGoogle = Ложь
//
Функция СсылкаНаКалендарьСотрудника(ОписаниеКалендаря, Пользователь)
	
	Если Не ЗначениеЗаполнено(ОписаниеКалендаря["id"]) Тогда
		Возврат ПредопределенноеЗначение("Справочник.КалендариСотрудников.ПустаяСсылка");
	КонецЕсли;
	
	НайденнаяСсылка = Справочники.КалендариСотрудников.СсылкаПоИдентификатору(
	ОписаниеКалендаря["id"],
	Пользователь);
	
	ДанныеЗаполнения = Новый Структура;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Если НайденнаяСсылка.ПометкаУдаления Тогда 
			НайденнаяСсылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
		КонецЕсли;

		КалендарьСотрудника = НайденнаяСсылка.ПолучитьОбъект();
		Если Не КалендарьСотрудника.СинхронизироватьСGoogle Тогда
			Возврат Справочники.КалендариСотрудников.ПустаяСсылка();
		КонецЕсли;
		
	Иначе
		
		НайденнаяСсылка = Справочники.КалендариСотрудников.СсылкаПоИдентификатору(
		ОписаниеКалендаря["id"]);   // Проверим наличие данного календаря уже в базе
		
		Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
			КалендарьСотрудника = НайденнаяСсылка.ПолучитьОбъект();
			Если ЗначениеЗаполнено(КалендарьСотрудника.ВладелецКалендаря) 
				И КалендарьСотрудника.СинхронизироватьСGoogle Тогда
				СообщениеПользователю = СтрШаблон(НСтр("ru='Календарь %1 уже используется пользователем %2!'"),
												  ОписаниеКалендаря["summary"],
												  КалендарьСотрудника.ВладелецКалендаря);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
				Возврат ПредопределенноеЗначение("Справочник.КалендариСотрудников.ПустаяСсылка");	
			КонецЕсли; 
		Иначе
			КалендарьСотрудника = Справочники.КалендариСотрудников.СоздатьЭлемент();	
		КонецЕсли;
		
		ДанныеЗаполнения.Вставить("Пользователь", Пользователь);
		ДанныеЗаполнения.Вставить("СинхронизироватьСGoogle", Истина);
		ДанныеЗаполнения.Вставить("ВладелецКалендаря", Пользователь);
		ДанныеЗаполнения.Вставить("ПометкаУдаления", Ложь);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеЗаполнения, ОписаниеКалендаря);
	ДанныеЗаполнения.Вставить("Наименование", ДанныеЗаполнения.summary);
	
	КалендарьСотрудника.Заполнить(ДанныеЗаполнения);
	
	КалендарьСотрудника.ОбменДанными.Загрузка = Истина;
	КалендарьСотрудника.Записать();
	
	Возврат КалендарьСотрудника.Ссылка;
	
КонецФункции

Процедура УстановитьКалендарьПоУмолчанию(КалендарьСотрудника, ДанныеЗаполнения)
	
	//Если Не ДанныеЗаполнения.Свойство("primary") Тогда
	//	Возврат;
	//КонецЕсли;

	//Если Не ДанныеЗаполнения.primary Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	НастройкиПользователей.Значение
	//|ИЗ
	//|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	//|ГДЕ
	//|	НастройкиПользователей.Пользователь = &Пользователь
	//|	И НастройкиПользователей.Настройка = &Настройка");
	//Запрос.УстановитьПараметр("Пользователь", ДанныеЗаполнения.Пользователь);
	//Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойКалендарь);
	//
	//ОсновнойКалендарь = Неопределено;
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	ОсновнойКалендарь = Выборка.Значение;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ОсновнойКалендарь) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(КалендарьСотрудника, "ОсновнойКалендарь", ДанныеЗаполнения.Пользователь);
	
КонецПроцедуры

Функция КвотаПользователя(ИмяПараметра)
	
	Результат = Формат(ОбщегоНазначения.ЗначениеРазделителяСеанса(), "ЧГ=");
	
	Если ЗначениеЗаполнено(ИмяПараметра) И ЗначениеЗаполнено(Результат) Тогда
		Возврат СтрШаблон("%1=%2", ИмяПараметра, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбменСGoogleРегистрацияЗаявкиПриЗаписи(Источник, Отказ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если Константы.ИспользоватьОбменСКалендаремGoogle.Получить() Тогда
		
		ТЗРаботы =  Источник.Работы.Выгрузить(,"Сотрудник, Номенклатура, ДатаНачала, ДатаОкончания");
		// Заменим незаполненного сотрудника сотрудником из шапки
		ПустыеСотрудники = ТЗРаботы.НайтиСтроки(Новый Структура("Сотрудник",Справочники.Сотрудники.ПустаяСсылка()));
		Для каждого СтрокаПустойСотрудник из ПустыеСотрудники Цикл
			СтрокаПустойСотрудник.Сотрудник = Источник.Сотрудник;
		КонецЦикла;
		
		МсСотрудника = Новый Массив;
		ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(МсСотрудника,ТЗРаботы.ВыгрузитьКолонку("Сотрудник"));
		
		ТЗВремяСотрудников = Источник.Работы.ВыгрузитьКолонки("Сотрудник, ДатаНачала, ДатаОкончания");
		Для каждого СтрокаВремениРабот из ТЗРаботы Цикл
			СтрокаТЗКонечная = ТЗВремяСотрудников.Найти(СтрокаВремениРабот.Сотрудник,"Сотрудник");
			Если СтрокаТЗКонечная = Неопределено Тогда
				СтрокаТЗКонечная = ТЗВремяСотрудников.Добавить();
				СтрокаТЗКонечная.Сотрудник = СтрокаВремениРабот.Сотрудник;				
			КонецЕсли;
			СтрокаТЗКонечная.ДатаНачала = ?(ЗначениеЗаполнено(СтрокаТЗКонечная.ДатаНачала), СтрокаТЗКонечная.ДатаНачала, СтрокаВремениРабот.ДатаНачала);
			СтрокаТЗКонечная.ДатаОкончания = СтрокаВремениРабот.ДатаОкончания;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаписиКалендаряСотрудника.Ссылка,
		|	ЗаписиКалендаряСотрудника.Календарь
		|ИЗ
		|	Справочник.ЗаписиКалендаряСотрудника КАК ЗаписиКалендаряСотрудника
		|ГДЕ
		|	ЗаписиКалендаряСотрудника.Источник = &Заявка";
		
		Запрос.УстановитьПараметр("Заявка", Источник.Ссылка); 
		РезультатЗаписи = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ЗаписьКалендаля Из РезультатЗаписи Цикл
			
			ЗаписьОбъект = ЗаписьКалендаля.Ссылка.ПолучитьОбъект();
			ЗаписьОбъект.УдаленаОтменена = Истина;
			ЗаписьОбъект.Записать();
			
		КонецЦикла;
			 
		Для Каждого СтрокаСотрудникВремя Из ТЗВремяСотрудников Цикл
			
			// Смотрим есть ли календари у сотрудников
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КалендариСотрудников.Ссылка
			|ИЗ
			|	Справочник.КалендариСотрудников КАК КалендариСотрудников
			|ГДЕ
			|	КалендариСотрудников.ВладелецКалендаря = &ВладелецКалендаря
			|	И КалендариСотрудников.СинхронизироватьСGoogle = ИСТИНА
			|	И НЕ КалендариСотрудников.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("ВладелецКалендаря", СтрокаСотрудникВремя.Сотрудник); 
			Результат = Запрос.Выполнить().Выгрузить();
			
			Если Результат.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
						
			Для Каждого Элем Из Результат Цикл 
				СтруктураОтбора = Новый Структура("Календарь", Элем.Ссылка);
				Найд = РезультатЗаписи.НайтиСтроки(СтруктураОтбора);
				
				Если Найд.Количество() > 0 Тогда 
					врОбъект = Найд[0].Ссылка.ПолучитьОбъект();
					Если врОбъект.ПометкаУдаления Тогда 
						врОбъект.ПометкаУдаления = Ложь;
					КонецЕсли;
				Иначе 
					врОбъект = Справочники.ЗаписиКалендаряСотрудника.СоздатьЭлемент();
				КонецЕсли;
				
				врОбъект.Наименование = ОбменСGoogleПереопределяемый.ПолучитьНаименованиеСобытия(Источник.Ссылка, СтрокаСотрудникВремя.Сотрудник, ТЗРаботы);
				
				врОбъект.Источник = Источник.Ссылка;
				врОбъект.Календарь = Элем.Ссылка;
				врОбъект.Начало = СтрокаСотрудникВремя.ДатаНачала;
				врОбъект.Окончание = СтрокаСотрудникВремя.ДатаОкончания;
				врОбъект.МестоПроведения = ОбменСGoogleПереопределяемый.ПолучитьМестоСобытия(Источник.Ссылка);
				
				Если Источник.Ссылка.Работы.Количество() > 0 Тогда 
					врОбъект.Описание = ОбменСGoogleПереопределяемый.ПолучитьОписаниеСобытия(Источник.Ссылка, СтрокаСотрудникВремя.Сотрудник, ТЗРаботы);
				КонецЕсли;
				Если Источник.Ссылка.Состояние = Справочники.ВидыСостоянийЗаявок.Отменена Или Источник.Ссылка.ПометкаУдаления Тогда
					врОбъект.УдаленаОтменена = Истина;
				Иначе
					врОбъект.УдаленаОтменена = Ложь;
				КонецЕсли;
				Основание = Источник.Основание;		
				
				Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЛистОжидания") и ЗначениеЗаполнено(Основание.GoogleIDСобытия) и Основание.GoogleКалендарьИмпорта = врОбъект.Календарь Тогда
					врОбъект.Идентификатор = Основание.GoogleIDСобытия;
				КонецЕсли;
				
				Попытка
					врОбъект.Записать();
				Исключение
					ЗаписьЖурналаРегистрации("Создание записи календаря сотрудника", , Источник.Ссылка, ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура СоздатьЛистОжиданияНаОсновеЗаписиКалендаря(ЗаписьКалендаря)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ЗаписьКалендаря.РезультатНовойЗаписи) Тогда
		ЛистОжидания = ЗаписьКалендаря.РезультатНовойЗаписи.ПолучитьОбъект();
		ЛистОжидания.ЖелаемоеВремя.Очистить();
	Иначе
		ЛистОжидания = Документы.ЛистОжидания.СоздатьДокумент();
		ЛистОжидания.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ВладелецКалендаря = ЗаписьКалендаря.Календарь.ВладелецКалендаря;
	ЛистОжидания.GoogleIDСобытия = ЗаписьКалендаря.Идентификатор;
	ЛистОжидания.GoogleКалендарьИмпорта = ЗаписьКалендаря.Календарь; 
	ЛистОжидания.Примечание = ЗаписьКалендаря.Наименование + Символы.ПС 
							+ ЗаписьКалендаря.МестоПроведения + Символы.ПС 
							+ ЗаписьКалендаря.Описание + Символы.ПС
							+ "С " + Строка(ЗаписьКалендаря.Начало) + " До " + Строка(ЗаписьКалендаря.Окончание) + Символы.ПС
							+ "Импортировано из Google-календаря сотрудника " 
							+ СтрШаблон("%1 %2.%3.",ВладелецКалендаря.Фамилия,Лев(ВладелецКалендаря.Имя,1),Лев(ВладелецКалендаря.Отчество,1));
	ЛистОжидания.Сотрудник = ВладелецКалендаря;
	ЛистОжидания.Выполнен = Ложь;
	ЛистОжидания.ПометкаУдаления = Ложь;
	
	ЛистОжидания.ДатаНачалаПлан = ЗаписьКалендаря.Начало;
	ЛистОжидания.ДатаОкончанияПлан = ЗаписьКалендаря.Окончание;
	Стр = ЛистОжидания.ЖелаемоеВремя.Добавить();
	Стр.Дата = ЗаписьКалендаря.Начало;
	Стр.Начало = ЗаписьКалендаря.Начало;
	Стр.Окончание = ЗаписьКалендаря.Окончание;
	
	ЛистОжидания.Записать();
	
	Если Не ЗначениеЗаполнено(ЗаписьКалендаря.РезультатНовойЗаписи) Тогда
		ЗаписьКалендаряОбъект = ЗаписьКалендаря.ПолучитьОбъект();
		ЗаписьКалендаряОбъект.РезультатНовойЗаписи = ЛистОжидания.Ссылка;
		ЗаписьКалендаряОбъект.Записать();
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.НепросмотренныеДокументыССайта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = ЛистОжидания.Ссылка;
	МенеджерЗаписи.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьИДПоследнегоПриложения() Экспорт
	
	ИдентификацияКлиента = РегистрыСведений.СеансовыеДанныеGoogle.ПолучитьМакет("client_secret_json").ПолучитьТекст();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ИдентификацияКлиента);
	
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON);
	
	ИД = РезультатЧтенияJSON.Количество() - 1;
	
	Возврат ИД; 
		
КонецФункции

Функция ИдПриложенияДляНовойСинхронизации() Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриложенияGoogle.ИдентификаторПриложения КАК ИдентификаторПриложения
	               |ИЗ
	               |	РегистрСведений.ПриложенияGoogle КАК ПриложенияGoogle
	               |ГДЕ
	               |	ПриложенияGoogle.Используется
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИдентификаторПриложения УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИдентификаторПриложения;	
	КонецЕсли; 
	
	ПараметрыПриложенийGoogle = РегистрыСведений.СеансовыеДанныеGoogle.ПолучитьМакет("client_secret_json");
	Возврат ПараметрыПриложенийGoogle.КоличествоСтрок() - 1;
	
КонецФункции

#КонецОбласти
